{
    "classes": [
        {
            "year": 2025,
            "posts": [
                {
                    "id": 1,
                    "location": "SBHS DLC",
                    "date": "01/17/2024",
                    "images": [
                        {
                            "src": "/gallery/2025/0117_1.jpg"
                        }
                    ],
                    "description": "CS Academy Class of 2025 got an exclusive dose of wisdom from our stellar SBHS alumni panel featuring Hitesh Ale, Kevin Chen, Neha Gogate, Pooja Raghuram, Shreya Venkateswaran, Sridula Kunamneni, Swathi Pulipati, Vrushti Patel, Yash Nishikant, and Zareeb Chowdhury! 🚀💻 From sharing insights on college life to diving into their courses and internships, their journey continues to inspire the next generation of tech enthusiasts."
                }
            ]
        },
        {
            "year": 2024,
            "posts": [ 
                {
                    "id": 0,
                    "location": "SBHS DLC",
                    "date": "12/01/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/1201_1.jpg"
                        }
                    ],
                    "description": "Exciting day at CSAcademy! Shoutout to Vinita, and our SBHS alumni, Kevin and Mikel, for coming in and talking with the academy. Sharing their experiences from college to the working world, they've given us invaluable insights and a burst of inspiration."
                },
                {
                    "id": 1,
                    "location": "Google NYC",
                    "date": "12/18/2024",
                    "images": [
                        {
                            "src": "/gallery/2024/1218_1.jpg"
                        }
                    ],
                    "description": "🚀 First field trip of the year and what a blast it was! The CS Academy crew invaded Rutgers University New Brunswick for a mind-blowing lecture on data structures by Dr. Ana Paula Centeno. 📚💡 Post-lecture, we hit the local scene for some delicious dinner, bonding over bytes and bites! 🍽️😄"
                },
                {
                    "id": 2,
                    "location": "Rutgers, New Jersey",
                    "date": "11/27/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/1127_1.jpg"
                        }
                    ],
                    "description": "Exploring the heart of tech innovation in NYC! 🏙️✨ Our field trip to the CS Academy office was nothing short of inspiring. From an enlightening panel discussion to an eye-opening tour of their incredible workspace, we got a glimpse of the future of work. Big thanks to our SBHS alumni hosts, Driv, Taanvi, Srikar, and all the amazing individuals who made this unforgettable experience possible. 🚀💡"
                },
                {
                    "id": 3,
                    "location": "Princeton, Research Computing",
                    "date": "01/19/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0119_1.jpg"
                        }
                    ],
                    "description": "We had our first field trip for 2023!! We went to the Princeton High-Performance Computing Data Center.\nWe got to go on a tour of the data center. Matthew Petty, a Data Center Facilities Manager at Princeton University showed us all the high-performance machines. We learned about all the different types of machinery it takes to make up the data center. It was very impressive how they are able to keep all their equipment running efficiently.\nThere was also a presentation given by Ian Cosden who is the Director of Research Software Engineering for Computational & Data Science, and Sushma Mendu, the Director of Software and Application Services at Princeton University.  They both spoke to us as well, about the different uses for the high performance center as well as opportunities they have there.  They let us know about the skill sets needed to succeed in the future.\nThe whole trip was really enjoyable and everyone had a great time. We can't thank the people at the Princeton HPC Data Center enough for it."
                },
                {
                    "id": 4,
                    "location": "Greenbrook Elementary",
                    "date": "02/28/2024",
                    "images": [
                        {
                            "src": "/gallery/2024/0228_1.jpg"
                        }
                    ],
                    "description": "We had an amazing time visiting Monmouth Junction Elementary and Greenbrook Elementary! Our CS Academy students led the way, teaching beginner coding on code.org to the enthusiastic 5th graders. The energy was electric, and we were blown away by the bright minds of these young learners. Here’s to inspiring the next generation of coders!"
                },
                {
                    "id": 5,
                    "location": "SBHS DLC",
                    "date": "06/21/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0621_1.jpg"
                        }
                    ],
                    "description": "It’s a wrap! We have officially ended the 2022-2023 CS Academy year."
                },
                {
                    "id": 6,
                    "location": "SBHS DLC",
                    "date": "03/30/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0330_1.jpg"
                        }
                    ],
                    "description": "This past Friday we had an event where technology professionals from Bank of America came in and spoke to us about Financial technology and how it is currently developing. We learned about how they are improving Fintech and online banking like Zelle. It was really interesting to hear about their current projects and ask questions regarding the field. Thank you so much to the Bank of America speakers for coming!"
                },
                {
                    "id": 7,
                    "location": "SBHS DLC",
                    "date": "03/17/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0317_1.jpg"
                        }
                    ],
                    "description": "SBHS CS Alumni event!!! On Friday, March 17th. We had former SBHS students who are pursuing CS or already work in industry, come in and talk to our CS Academy students. The whole event was a success from having fun conversations to getting great advice for all of our futures in the field."
                },
                {
                    "id": 8,
                    "location": "SBHS DLC",
                    "date": "02/17/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0217_1.jpg"
                        }
                    ],
                    "description": "We were given an intro to our Lockheed Martin mentoring sessions today. Our mentor William Karavites told us about the structure of the future sessions. We are eager to learn more about Code Quest Academy and everything it has to offer."
                },
                {
                    "id": 9,
                    "location": "SBHS DLC",
                    "date": "02/07/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0207_1.jpg"
                        }
                    ],
                    "description": "On Monday we had Dr. Adrienne Jensen from Activcore came in and taught us importance of proper ergonomics, and exercise that should be performed for people who spend a lot of time at the computer. The exercises provided can help us long term. It was a lot of fun getting to move around rather than sitting in a chair for 90 minutes."
                },
                {
                    "id": 10,
                    "location": "SBHS DLC",
                    "date": "02/03/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0203_1.jpg"
                        }
                    ],
                    "description": "CS women Vikings meeting to talk about enrollment in cs academy. We hope to see all of you next year part of the academy."
                },
                {
                    "id": 11,
                    "location": "SBHS",
                    "date": "01/14/2023",
                    "images": [
                        {
                            "src": "/gallery/2024/0114_1.jpg"
                        }
                    ],
                    "description": "Hey guys, welcome to the official SBHS CS Academy Instagram and our first year of CS Academy!! Join us as we take a journey through the exciting world of VR and Game Design, where we get to immerse ourselves in virtual reality. As well as Mobile Applications where we can turn our ideas into reality by developing android apps."
                }
            ]
        },
        {
            "year": 2026,
            "posts": []
        }
    ]
}